In [1]:
import pandas as pd
import numpy as np

In [57]:
pd.__version__

'2.2.2'

In [58]:
#Series=1D,Data Frame=2D

In [59]:
pd.Series?

Init signature:
pd.Series(
    data=None,
    index=None,
    dtype: 'Dtype | None' = None,
    name=None,
    copy: 'bool | None' = None,
    fastpath: 'bool | lib.NoDefault' = <no_default>,
) -> 'None'
Docstring:
One-dimensional ndarray with axis labels (including time series).

Labels need not be unique but must be a hashable type. The object
supports both integer- and label-based indexing and provides a host of
methods for performing operations involving the index. Statistical
methods from ndarray have been overridden to automatically exclude
missing data (currently represented as NaN).

Operations between Series (+, -, /, \*, \*\*) align values based on their
associated index values-- they need not be the same length. The result
index will be the sorted union of the two indexes.

Parameters
----------
data : array-like, Iterable, dict, or scalar value
    Contains data stored in Series. If data is a dict, argument order is
    maintained.
index : array-like or Index (1d)
    Values must be hashable and have the same length as `data`.
    Non-unique index values are allowed. Will default to
    RangeIndex (0, 1, 2, ..., n) if not provided. If data is dict-like
    and index is None, then the keys in the data are used as the index. If the
    index is not None, the resulting Series is reindexed with the index values.
dtype : str, numpy.dtype, or ExtensionDtype, optional
    Data type for the output Series. If not specified, this will be
    inferred from `data`.
    See the :ref:`user guide <basics.dtypes>` for more usages.
name : Hashable, default None
    The name to give to the Series.
copy : bool, default False
    Copy input data. Only affects Series or 1d ndarray input. See examples.

Notes
-----
Please reference the :ref:`User Guide <basics.series>` for more information.

Examples
--------
Constructing Series from a dictionary with an Index specified

>>> d = {'a': 1, 'b': 2, 'c': 3}
>>> ser = pd.Series(data=d, index=['a', 'b', 'c'])
>>> ser
a   1
b   2
c   3
dtype: int64

The keys of the dictionary match with the Index values, hence the Index
values have no effect.

>>> d = {'a': 1, 'b': 2, 'c': 3}
>>> ser = pd.Series(data=d, index=['x', 'y', 'z'])
>>> ser
x   NaN
y   NaN
z   NaN
dtype: float64

Note that the Index is first build with the keys from the dictionary.
After this the Series is reindexed with the given Index values, hence we
get all NaN as a result.

Constructing Series from a list with `copy=False`.

>>> r = [1, 2]
>>> ser = pd.Series(r, copy=False)
>>> ser.iloc[0] = 999
>>> r
[1, 2]
>>> ser
0    999
1      2
dtype: int64

Due to input data type the Series has a `copy` of
the original data even though `copy=False`, so
the data is unchanged.

Constructing Series from a 1d ndarray with `copy=False`.

>>> r = np.array([1, 2])
>>> ser = pd.Series(r, copy=False)
>>> ser.iloc[0] = 999
>>> r
array([999,   2])
>>> ser
0    999
1      2
dtype: int64

Due to input data type the Series has a `view` on
the original data, so
the data is changed as well.
File:           c:\users\samarth\appdata\local\programs\python\python312\lib\site-packages\pandas\core\series.py
Type:           type
Subclasses:     SubclassedSeries

In [60]:
m=pd.Series(range(1,9))

In [61]:
m.index

RangeIndex(start=0, stop=8, step=1)

In [62]:
ar=[1,2]
ar

[1, 2]

In [63]:
tab=pd.Series(ar,['x','y'])

In [64]:
tab['y']

2

In [65]:
tab

x    1
y    2
dtype: int64

In [66]:
tab.mean()

1.5

In [67]:
tab.min()

1

In [13]:
tab1=pd.Series(['x','y'],ar)
tab1

1    x
2    y
dtype: object

In [14]:
tab2=pd.Series([30,50,40],['Maths','Data Sci.','Calculas'])
tab2

Maths        30
Data Sci.    50
Calculas     40
dtype: int64

In [15]:
tab2.values

array([30, 50, 40], dtype=int64)

In [16]:
tab2.index

Index(['Maths', 'Data Sci.', 'Calculas'], dtype='object')

In [17]:
tab2.index[2]

'Calculas'

In [18]:
dmarks={'kishan':-99,'rudra':-20,'samarth':100}
dmarks

{'kishan': -99, 'rudra': -20, 'samarth': 100}

In [19]:
mark=pd.Series(dmarks)
mark

kishan     -99
rudra      -20
samarth    100
dtype: int64

In [20]:
mark.values

array([-99, -20, 100], dtype=int64)

In [21]:
mark.index

Index(['kishan', 'rudra', 'samarth'], dtype='object')

In [22]:
tab1=pd.Series(index=['x','y'],data=ar)
tab1
display(tab1.values,tab1.index)

array([1, 2], dtype=int64)

Index(['x', 'y'], dtype='object')

In [23]:
tab1=pd.Series(index=['x',2],data=ar)
tab1
display(tab1.values,tab1.index)

array([1, 2], dtype=int64)

Index(['x', 2], dtype='object')

In [24]:
mark

kishan     -99
rudra      -20
samarth    100
dtype: int64

In [25]:
mark[:'rudra']

kishan   -99
rudra    -20
dtype: int64

In [26]:
arr=pd.Series(range(1,10),range(1,10))
arr

1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [27]:
arr[:8]

1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
dtype: int64

In [28]:
pd.Series({'Hina':'A+','Diya':'C'})

Hina    A+
Diya     C
dtype: object

In [29]:
#turple and list compriantion

In [30]:
pd.Series((1,2,3,4))

0    1
1    2
2    3
3    4
dtype: int64

In [31]:
pd.Series([x for x in range(1,10)])

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [32]:
pd.DataFrame?

Init signature:
pd.DataFrame(
    data=None,
    index: 'Axes | None' = None,
    columns: 'Axes | None' = None,
    dtype: 'Dtype | None' = None,
    copy: 'bool | None' = None,
) -> 'None'
Docstring:
Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns).
Arithmetic operations align on both row and column labels. Can be
thought of as a dict-like container for Series objects. The primary
pandas data structure.

Parameters
----------
data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame
    Dict can contain Series, arrays, constants, dataclass or list-like objects. If
    data is a dict, column order follows insertion-order. If a dict contains Series
    which have an index defined, it is aligned by its index. This alignment also
    occurs if data is a Series or a DataFrame itself. Alignment is done on
    Series/DataFrame inputs.

    If data is a list of dicts, column order follows insertion-order.

index : Index or array-like
    Index to use for resulting frame. Will default to RangeIndex if
    no indexing information part of input data and no index provided.
columns : Index or array-like
    Column labels to use for resulting frame when data does not have them,
    defaulting to RangeIndex(0, 1, 2, ..., n). If data contains column labels,
    will perform column selection instead.
dtype : dtype, default None
    Data type to force. Only a single dtype is allowed. If None, infer.
copy : bool or None, default None
    Copy data from inputs.
    For dict data, the default of None behaves like ``copy=True``.  For DataFrame
    or 2d ndarray input, the default of None behaves like ``copy=False``.
    If data is a dict containing one or more Series (possibly of different dtypes),
    ``copy=False`` will ensure that these inputs are not copied.

    .. versionchanged:: 1.3.0

See Also
--------
DataFrame.from_records : Constructor from tuples, also record arrays.
DataFrame.from_dict : From dicts of Series, arrays, or dicts.
read_csv : Read a comma-separated values (csv) file into DataFrame.
read_table : Read general delimited file into DataFrame.
read_clipboard : Read text from clipboard into DataFrame.

Notes
-----
Please reference the :ref:`User Guide <basics.dataframe>` for more information.

Examples
--------
Constructing DataFrame from a dictionary.

>>> d = {'col1': [1, 2], 'col2': [3, 4]}
>>> df = pd.DataFrame(data=d)
>>> df
   col1  col2
0     1     3
1     2     4

Notice that the inferred dtype is int64.

>>> df.dtypes
col1    int64
col2    int64
dtype: object

To enforce a single dtype:

>>> df = pd.DataFrame(data=d, dtype=np.int8)
>>> df.dtypes
col1    int8
col2    int8
dtype: object

Constructing DataFrame from a dictionary including Series:

>>> d = {'col1': [0, 1, 2, 3], 'col2': pd.Series([2, 3], index=[2, 3])}
>>> pd.DataFrame(data=d, index=[0, 1, 2, 3])
   col1  col2
0     0   NaN
1     1   NaN
2     2   2.0
3     3   3.0

Constructing DataFrame from numpy ndarray:

>>> df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
...                    columns=['a', 'b', 'c'])
>>> df2
   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

Constructing DataFrame from a numpy ndarray that has labeled columns:

>>> data = np.array([(1, 2, 3), (4, 5, 6), (7, 8, 9)],
...                 dtype=[("a", "i4"), ("b", "i4"), ("c", "i4")])
>>> df3 = pd.DataFrame(data, columns=['c', 'a'])
...
>>> df3
   c  a
0  3  1
1  6  4
2  9  7

Constructing DataFrame from dataclass:

>>> from dataclasses import make_dataclass
>>> Point = make_dataclass("Point", [("x", int), ("y", int)])
>>> pd.DataFrame([Point(0, 0), Point(0, 3), Point(2, 3)])
   x  y
0  0  0
1  0  3
2  2  3

Constructing DataFrame from Series/DataFrame:

>>> ser = pd.Series([1, 2, 3], index=["a", "b", "c"])
>>> df = pd.DataFrame(data=ser, index=["a", "c"])
>>> df
   0
a  1
c  3

>>> df1 = pd.DataFrame([1, 2, 3], index=["a", "b", "c"], columns=["x"])
>>> df2 = pd.DataFrame(data=df1, index=["a", "c"])
>>> df2
   x
a  1
c  3
File:           c:\users\samarth\appdata\local\programs\python\python312\lib\site-packages\pandas\core\frame.py
Type:           type
Subclasses:     SubclassedDataFrame

In [33]:
pd.DataFrame({'Riya':[54,23],'sam':[101,102]},['python','fds'])

        Riya  sam
python    54  101
fds       23  102

In [34]:
pd.DataFrame([[23,24,25],[45,46,47]],columns=['A','B','C'],index=['Py','Ds'])

     A   B   C
Py  23  24  25
Ds  45  46  47

In [35]:
np.random.seed(7)
marks=pd.DataFrame(np.random.randint(0,30,(3,3)),index=['Sia','Tisha','Riya'],columns=['math','cal','R'])
marks

       math  cal   R
Sia      15    4  25
Tisha    22    3  19
Riya     23    7  28

In [36]:
marks.columns

Index(['math', 'cal', 'R'], dtype='object')

In [37]:
marks.values

array([[15,  4, 25],
       [22,  3, 19],
       [23,  7, 28]])

In [38]:
marks.index

Index(['Sia', 'Tisha', 'Riya'], dtype='object')

In [39]:
marks['R']

Sia      25
Tisha    19
Riya     28
Name: R, dtype: int32

In [40]:
marks.loc['Riya']#we will pass label

math    23
cal      7
R       28
Name: Riya, dtype: int32

In [41]:
marks.loc['Riya','math']

23

In [42]:
marks.loc['Riya','math':'R']

math    23
cal      7
R       28
Name: Riya, dtype: int32

In [43]:
marks['Total']=marks['R']+marks['math']+marks['cal']

In [44]:
marks

       math  cal   R  Total
Sia      15    4  25     44
Tisha    22    3  19     44
Riya     23    7  28     58

In [45]:
g=[]
for i in marks["Total"]:
    if(i<90):
        g.append('Fail')
    else:
        g.append('Pass')
marks['Grade']=g
marks

       math  cal   R  Total Grade
Sia      15    4  25     44  Fail
Tisha    22    3  19     44  Fail
Riya     23    7  28     58  Fail

In [46]:
#indexing and selection
marks[['R','cal']]

        R  cal
Sia    25    4
Tisha  19    3
Riya   28    7

In [47]:
marks.iloc? # we will pass index

SyntaxError: invalid syntax (1500094646.py, line 1)

In [68]:
marks.iloc[0:2,0:3]

       math  cal   R
Sia      15    4  25
Tisha    22    3  19

In [69]:
marks.iloc[:,3]

Sia      44
Tisha    44
Riya     58
Name: Total, dtype: int32

In [70]:
marks.iloc[:,3:4]

       Total
Sia       44
Tisha     44
Riya      58

In [71]:
marks.loc['Sia',['cal','R']]

cal     4
R      25
Name: Sia, dtype: object

In [72]:
marks.Total[marks.R>20]

Sia     44
Riya    58
Name: Total, dtype: int32

In [73]:
marks[marks.R>20].index

Index(['Sia', 'Riya'], dtype='object')

In [74]:
marks[marks['R']<20]

       math  cal   R  Total Grade
Tisha    22    3  19     44  Fail

In [75]:
np.random.seed(2)
Marks=pd.DataFrame(np.random.randint(0,100,(10,3)),index=['s','a','m','a','r','t','h','s','a','r'],columns=['Math','Phy','Py'])
Marks

   Math  Phy  Py
s    40   15  72
a    22   43  82
m    75    7  34
a    49   95  75
r    85   47  63
t    31   90  20
h    37   39  67
s     4   42  51
a    38   33  58
r    67   69  88

In [76]:
Marks.Math[Marks.Math<40]=41

C:\Users\SAMARTH\AppData\Local\Temp\ipykernel_16028\783743233.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  Marks.Math[Marks.Math<40]=41

In [77]:
Marks

   Math  Phy  Py
s    40   15  72
a    41   43  82
m    75    7  34
a    49   95  75
r    85   47  63
t    41   90  20
h    41   39  67
s    41   42  51
a    41   33  58
r    67   69  88

In [78]:
## Pandas Assignment

In [79]:
#1
df = pd.DataFrame({"ProductId": [101, 102, 103, 104, 105],"ProductName": ["Laptop", "Smartphone", "Headphones", "Monitor", "Keyboard"],
"ProductPrice":  [999.99, 499.99, 89.99, 199.99, 29.99]})
df

   ProductId ProductName  ProductPrice
0        101      Laptop        999.99
1        102  Smartphone        499.99
2        103  Headphones         89.99
3        104     Monitor        199.99
4        105    Keyboard         29.99

In [80]:
#2
df.ProductPrice+500

0    1499.99
1     999.99
2     589.99
3     699.99
4     529.99
Name: ProductPrice, dtype: float64

In [81]:
#6
for i in range(len(df)):
    print(i)
    print(df.iloc[i])
    print()

0
ProductId          101
ProductName     Laptop
ProductPrice    999.99
Name: 0, dtype: object

1
ProductId              102
ProductName     Smartphone
ProductPrice        499.99
Name: 1, dtype: object

2
ProductId              103
ProductName     Headphones
ProductPrice         89.99
Name: 2, dtype: object

3
ProductId           104
ProductName     Monitor
ProductPrice     199.99
Name: 3, dtype: object

4
ProductId            105
ProductName     Keyboard
ProductPrice       29.99
Name: 4, dtype: object

In [82]:
#6
for i in df.index:
    print(i)
    print(df.loc[i])
    print()

0
ProductId          101
ProductName     Laptop
ProductPrice    999.99
Name: 0, dtype: object

1
ProductId              102
ProductName     Smartphone
ProductPrice        499.99
Name: 1, dtype: object

2
ProductId              103
ProductName     Headphones
ProductPrice         89.99
Name: 2, dtype: object

3
ProductId           104
ProductName     Monitor
ProductPrice     199.99
Name: 3, dtype: object

4
ProductId            105
ProductName     Keyboard
ProductPrice       29.99
Name: 4, dtype: object

In [83]:
#7
df.loc[2]

ProductId              103
ProductName     Headphones
ProductPrice         89.99
Name: 2, dtype: object

In [84]:
#8
df.iloc[1]['ProductPrice']

499.99

In [85]:
#9
df.loc[1:3]-['ProductPrice']

ValueError: Unable to coerce to Series, length must be 3: given 1

In [86]:
#------------------

In [87]:
rng=np.random.RandomState(42)
rng

RandomState(MT19937) at 0x1DFFA824B40

In [88]:
ser=pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [89]:
df=pd.DataFrame(rng.randint(0,10,(3,4)),columns=['A','B','C','D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [90]:
np.exp(ser)#exponecial

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [91]:
np.sin(df*np.pi/4)#sin(x)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [92]:
area=pd.Series({'UP':243286,'Maharashtra':307713,'Bihar':94163},name='area')
area

UP             243286
Maharashtra    307713
Bihar           94163
Name: area, dtype: int64

In [93]:
population = pd.Series({'West Bangal':91276115,'Maharashtra':124484447,'Bihar':104099452},name='population')
population

West Bangal     91276115
Maharashtra    124484447
Bihar          104099452
Name: population, dtype: int64

In [94]:
population_density=population/area
population_density

Bihar          1105.523953
Maharashtra     404.547247
UP                     NaN
West Bangal            NaN
dtype: float64

In [95]:
A=pd.Series([2,4,6],index=[0,1,2])
A

0    2
1    4
2    6
dtype: int64

In [96]:
B=pd.Series([1,3,5],index=[1,2,3])
B

1    1
2    3
3    5
dtype: int64

In [97]:
A+B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [98]:
A.add(B,fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [99]:
A=pd.DataFrame(rng.randint(0,15,(2,2)),columns=list('AB'))
A

    A   B
0   1   7
1  11  13

In [100]:
B=pd.DataFrame(rng.randint(0,10,(3,3)),columns=list('BAC'))
B

   B  A  C
0  5  1  4
1  0  9  5
2  8  0  9

In [101]:
A+B

      A     B   C
0   2.0  12.0 NaN
1  20.0  13.0 NaN
2   NaN   NaN NaN

In [102]:
A.add(B,fill_value=A.stack().mean())

      A     B     C
0   2.0  12.0  12.0
1  20.0  13.0  13.0
2   8.0  16.0  17.0

In [103]:
A.stack().mean()

8.0

In [104]:
np.random.seed(10)
np.random.randint(0,10,(2,2))

array([[9, 4],
       [0, 1]])

In [105]:
 rng.rand(3,3)

array([[0.04666566, 0.97375552, 0.23277134],
       [0.09060643, 0.61838601, 0.38246199],
       [0.98323089, 0.46676289, 0.85994041]])

In [106]:
 rng.rand(3,3)

array([[0.68030754, 0.45049925, 0.01326496],
       [0.94220176, 0.56328822, 0.3854165 ],
       [0.01596625, 0.23089383, 0.24102547]])

In [110]:
Y= rng.rand(3,3)

In [111]:
Y

array([[0.56770033, 0.03131329, 0.84228477],
       [0.44975413, 0.39515024, 0.92665887],
       [0.727272  , 0.32654077, 0.57044397]])

In [113]:
Z=np.random.rand(3,3)

In [114]:
Z

array([[0.74880388, 0.49850701, 0.22479665],
       [0.19806286, 0.76053071, 0.16911084],
       [0.08833981, 0.68535982, 0.95339335]])

In [115]:
Z

array([[0.74880388, 0.49850701, 0.22479665],
       [0.19806286, 0.76053071, 0.16911084],
       [0.08833981, 0.68535982, 0.95339335]])

In [116]:
A=np.random.randint(10,size=(3,4))
A

array([[6, 8, 1, 8],
       [4, 1, 3, 6],
       [5, 3, 9, 6]])

In [117]:
A-A[0]

array([[ 0,  0,  0,  0],
       [-2, -7,  2, -2],
       [-1, -5,  8, -2]])

In [118]:
df = pd.DataFrame(A,columns=list('QRST'))
df

   Q  R  S  T
0  6  8  1  8
1  4  1  3  6
2  5  3  9  6

In [119]:
df-df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -2 -7  2 -2
2 -1 -5  8 -2

In [120]:
df.subtract(df['R'],axis=0)

   Q  R  S  T
0 -2  0 -7  0
1  3  0  2  5
2  2  0  6  3

In [121]:
halfrow=df.iloc[0,::2]
halfrow

Q    6
S    1
Name: 0, dtype: int32

In [122]:
df-halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -2.0 NaN  2.0 NaN
2 -1.0 NaN  8.0 NaN

In [123]:
df

   Q  R  S  T
0  6  8  1  8
1  4  1  3  6
2  5  3  9  6

In [124]:
vals1=np.array([1,None,2,3])
vals1

array([1, None, 2, 3], dtype=object)

In [125]:
%timeit np.arange(1E6,dtype=int).sum()#1E6= 1 x 10^6?

1.1 ms ± 51.4 μs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [126]:
%timeit np.arange(1E6,dtype=object).sum()

32.9 ms ± 2.24 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [127]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [129]:
vals2=np.array([1,np.nan,3,4])
vals2

array([ 1., nan,  3.,  4.])

In [130]:
vals2.sum(),vals2.max(),vals2.min(),vals2.mean()

(nan, nan, nan, nan)

In [131]:
np.nansum(vals2),np.nanmax(vals2),np.nanmin(vals2),np.nanmean(vals2)

(8.0, 4.0, 1.0, 2.6666666666666665)

In [132]:
pd.Series([1,np.nan,2,None,pd.NA],dtype='Int32')#Int32 mean there is null value , int32 mean there is not a single null value

0       1
1    <NA>
2       2
3    <NA>
4    <NA>
dtype: Int32

In [133]:
np.arange(100,dtype=object)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18,
       19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35,
       36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52,
       53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69,
       70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86,
       87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99], dtype=object)

In [134]:
#isnull,notnull,dropna,fillna

In [135]:
data=pd.Series([1,np.nan,'hello',None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [136]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [137]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [138]:
data.dropna()

0        1
2    hello
dtype: object

In [139]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [140]:
df=pd.DataFrame([[1,np.nan,2],[2,3,5],[np.nan,4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [141]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [142]:
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [143]:
df[3]=np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [144]:
df.dropna(axis='columns',how='all')#column which has all nan value will be drop out

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [145]:
df.dropna(axis='rows',thresh=3)#row me minimum 3 nan hoga to ye use drop kar de ga

     0    1  2   3
1  2.0  3.0  5 NaN

In [146]:
data=pd.Series([1,np.nan,2,None,3],index=list('abcde'),dtype='Int32')
data

a       1
b    <NA>
c       2
d    <NA>
e       3
dtype: Int32

In [147]:
data.fillna(0)

a    1
b    0
c    2
d    0
e    3
dtype: Int32

In [148]:
data.fillna(method='ffill')#ffill=forward fill #you can also use nn.ffill()

C:\Users\SAMARTH\AppData\Local\Temp\ipykernel_16028\3439620758.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='ffill')#ffill=forward fill #you can also use nn.ffill()

a    1
b    1
c    2
d    2
e    3
dtype: Int32

In [149]:
data.fillna(method='bfill')#nn.bfill()

C:\Users\SAMARTH\AppData\Local\Temp\ipykernel_16028\2344759726.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='bfill')#nn.bfill()

a    1
b    2
c    2
d    3
e    3
dtype: Int32

In [150]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [151]:
df.fillna(method='ffill',axis=1)#0=column,1=row

C:\Users\SAMARTH\AppData\Local\Temp\ipykernel_16028\1265886752.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill',axis=1)#0=column,1=row

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [152]:
df.fillna(method='bfill',axis=1)

C:\Users\SAMARTH\AppData\Local\Temp\ipykernel_16028\3381026564.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill',axis=1)

     0    1    2   3
0  1.0  2.0  2.0 NaN
1  2.0  3.0  5.0 NaN
2  4.0  4.0  6.0 NaN

In [11]:
index=[('California',2010),('California',2020),('New York',2010),('New York',2020),('Texas',2010),('Texas',2020)]
population = [37253956,39538223,19378102,20201249,25145561,29145505]
pop=pd.Series(population,index)
pop

(California, 2010)    37253956
(California, 2020)    39538223
(New York, 2010)      19378102
(New York, 2020)      20201249
(Texas, 2010)         25145561
(Texas, 2020)         29145505
dtype: int64

In [12]:
index=pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2010),
            ('California', 2020),
            (  'New York', 2010),
            (  'New York', 2020),
            (     'Texas', 2010),
            (     'Texas', 2020)],
           )

In [13]:
pop = pop.reindex(index)
pop

California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [14]:
pop[:,2020]

California    39538223
New York      20201249
Texas         29145505
dtype: int64

In [15]:
pop

California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [16]:
pop_df =  pop.unstack() #jupyter update nahi hai isiliye error dega
pop_df

                2010      2020
California  37253956  39538223
New York    19378102  20201249
Texas       25145561  29145505

In [17]:
pop_df.stack()

California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [18]:
pop_df= pd.DataFrame({'total':pop,'under18':[9284094,8898092,4318033,4181528,6879014,7432474]})
pop_df

                    total  under18
California 2010  37253956  9284094
           2020  39538223  8898092
New York   2010  19378102  4318033
           2020  20201249  4181528
Texas      2010  25145561  6879014
           2020  29145505  7432474

In [19]:
f_u18 = pop_df['under18']/pop_df['total']
f_u18

California  2010    0.249211
            2020    0.225050
New York    2010    0.222831
            2020    0.206994
Texas       2010    0.273568
            2020    0.255013
dtype: float64

In [20]:
f_u18.unstack()

                2010      2020
California  0.249211  0.225050
New York    0.222831  0.206994
Texas       0.273568  0.255013

In [21]:
df = pd.DataFrame(np.random.rand(4,2),index = [['a','a','b','b'],[1,2,1,2]],columns = ['data1','data2'])
df

        data1     data2
a 1  0.238799  0.924077
  2  0.125091  0.862376
b 1  0.153745  0.301614
  2  0.744961  0.093608

In [22]:
df.stack()

a  1  data1    0.238799
      data2    0.924077
   2  data1    0.125091
      data2    0.862376
b  1  data1    0.153745
      data2    0.301614
   2  data1    0.744961
      data2    0.093608
dtype: float64

In [23]:
df.stack().unstack()

        data1     data2
a 1  0.238799  0.924077
  2  0.125091  0.862376
b 1  0.153745  0.301614
  2  0.744961  0.093608

In [24]:
pd.MultiIndex(levels=[['a','b'],[0,2]],codes=[[0,0,1,1,1],[0,1,0,1,0]])

MultiIndex([('a', 0),
            ('a', 2),
            ('b', 0),
            ('b', 2),
            ('b', 0)],
           )

In [25]:
pop.index.names=['state','year']
pop

state       year
California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [26]:
index = pd.MultiIndex.from_product([[2013,2014],[1,2]],names=['year','visit'])
columns =pd.MultiIndex.from_product([['Bob','Guido','Sue'],['HR','Temp']],names=['subject','type'])

data=np.round(np.random.randn(4,6),1)
data[:,::2]*=10 # all HR value will be x 10
data +=37

health_data=pd.DataFrame(data,index=index,columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      37.0  38.3  30.0  37.2  40.0  38.6
     2      47.0  38.2  27.0  36.6  38.0  38.9
2014 1      53.0  34.7  34.0  37.8  37.0  37.0
     2      55.0  36.2  44.0  36.0  29.0  37.2

In [27]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      30.0  37.2
     2      27.0  36.6
2014 1      34.0  37.8
     2      44.0  36.0

In [28]:
pop['California',2010]

37253956

In [29]:
pop[pop>200000]

state       year
California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [30]:
health_data['Guido','HR']

year  visit
2013  1        30.0
      2        27.0
2014  1        34.0
      2        44.0
Name: (Guido, HR), dtype: float64

In [31]:
health_data.iloc[:2,:2]

subject      Bob
type          HR  Temp
year visit
2013 1      37.0  38.3
     2      47.0  38.2

In [32]:
health_data.loc[:,('Bob','HR')]

year  visit
2013  1        37.0
      2        47.0
2014  1        53.0
      2        55.0
Name: (Bob, HR), dtype: float64

In [33]:
idx=pd.IndexSlice
health_data.loc[idx[:,1],idx[:,'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      37.0  30.0  40.0
2014 1      53.0  34.0  37.0

In [34]:
index = pd.MultiIndex.from_product([['a','c','b'],[1,2]])
data = pd.Series(np.random.rand(6),index=index)
data.index.names = ['char','int']
data

char  int
a     1      0.982339
      2      0.369884
c     1      0.773208
      2      0.601115
b     1      0.357416
      2      0.938547
dtype: float64

In [35]:
try:
    data['a':'b']
except KeyError as e:
    print(e)

'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [36]:
data=data.sort_index()
data

char  int
a     1      0.982339
      2      0.369884
b     1      0.357416
      2      0.938547
c     1      0.773208
      2      0.601115
dtype: float64

In [37]:
data['a':'b']

char  int
a     1      0.982339
      2      0.369884
b     1      0.357416
      2      0.938547
dtype: float64

In [38]:
pop

state       year
California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [41]:
n=pop.unstack(level=0)
n

state  California  New York     Texas
year
2010     37253956  19378102  25145561
2020     39538223  20201249  29145505

In [42]:
p=pop.unstack(level=1)
p

year            2010      2020
state
California  37253956  39538223
New York    19378102  20201249
Texas       25145561  29145505

In [43]:
n.stack()

year  state
2010  California    37253956
      New York      19378102
      Texas         25145561
2020  California    39538223
      New York      20201249
      Texas         29145505
dtype: int64

In [44]:
p.stack()

state       year
California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [45]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2010    37253956
1  California  2020    39538223
2    New York  2010    19378102
3    New York  2020    20201249
4       Texas  2010    25145561
5       Texas  2020    29145505

In [46]:
pop_flat.set_index(['state','year'])

                 population
state      year
California 2010    37253956
           2020    39538223
New York   2010    19378102
           2020    20201249
Texas      2010    25145561
           2020    29145505